{"home":{"content":"# More Flux Practice\n\nWelcome to Lecture 60! Here is a brief class breakdown.\n\n## Learning Objectives\n1. Get comfortable with building UIs using Flux and React\n\n## Game Plan\n\n### [State of Class](#state-of-class)\n### [Final Project Requirements](#final-project-requirements)\n### [Warmup](#warmup)\n### [Slack Clone](#slack-clone)","idx":0},"title":{"content":"More Flux Practice","idx":1},"desc":{"content":"Get comfortable with Flux and React","idx":2},"state-of-class":{"content":"# State of Class\n\nClass is almost over! **W**. **T**. **F**.\n\nHere's what's left for us to cover:\n\n### Routing\nSpecifically, react-router. We will cover basic routing in class but react-router coverage will most likely be an additional lecture I record outside of class hours.\n\n### Deployment\n\nI don't think we have time / it's worth covering this in class. I will record an additional lecture covering **Heroku** outside of class hours. For final project specific deployment considerations, we will discuss individually and handle on  case by case basis.\n\n### Final Project\n\nThis is the new priority - we have to make sure these projects on delivered on point and **legit**. Today will probably be the last day of formal lecture (as per curriculum).","idx":3},"final-project-requirements":{"content":"# Final Project Requirements\n\nThere's a few things we **need** to do tonight\n\n## Pls do right now\n\n1. Create a github repo for your final project. You can call it **final-project** if you don't have a name for it yet. **But** highly preferred if you give it an appropriate name.\n2. Create a **README** for your repo, briefly describe what the project is about (for now).\n3. Make me (github handle: **mottaquikarim**) a **collaborator** on the project.\n4. Set up a time to **[meet with me](https://docs.google.com/spreadsheets/d/1YjRPcJWeJKRTEZDXLWVPztzCGa0XjBm1HmurKXjMq2k/edit)**. If slots are all taken for today, please hit me up on slack and we will schedule an appropriate time.\n5. **WE HAVE TWO(ish) WEEKS LEFT**. Get started on your projects. ","idx":4},"warmup":{"content":"# Warmup\n\nLet's do a few warmups.\n\n## Read React-Native Code\n\nConsider **[this](https://github.com/mottaquikarim/react-native-redux-simple)** repo. Download/clone it - you won't be able to run it, this is ok. Without running the code, look through the file structure and figure out what it does.\n\nSpecifically,\n\n* what actions are dispatched?\n* is this using a UI library of some sort (ie: semantic-ui)? How do you know?\n* are there any reducers? what do they do? how do they work? \n* are there any differences between web dev and this environment? What are they? do they have equivalents in web dev envs?\n\nThe hope is to illustrate how similar this is to what we have been doing...even though it's a completely different env.\n\n## Flux Practice Lite\n\n**[Clone](https://github.com/mottaquikarim/nycda_react_starter/tree/flux_boilerplate)** this repo. Update the functionality so that the user is able to both increment **and** decrement the counter.\n\nHow you choose to implement this functionality is up to you.\n\n## Flux Practice Hardcore\n\n**[Clone](https://github.com/mottaquikarim/nycda_react_starter/tree/flux_boilerplate)** this repo. \n\nCreate an iOS style alarm app.\n\nHere are the main requirements (feel free to build UI, etc however you wish - obvi it should use flux)\n\n* User has ability to create a new alarm. A new alarm will take the following properties:\n * **Alarm Name** \n * **Alarm Time**\n * **#STRETCHGOAL**: add ability to specify a day as well\n* User can view a full list of all the \"active\" alarms.\n* Once alarm time occurs, your app should set off alarm. You can just pop up an **alert** message for now. **#STRETCHGOAL**: support web page push notifications to serve as your \"alert\" instead\n* After alarm goes off, it is no longer \"active\", meaning it should be displayed in the UI as inactive. **NOTE**: it should only be removed when user hits a delete button of some sort. However, it should not ever set alarm again.\n* User has ability to edit an alarm at any time **and** re-activate an already inactive alarm.\n\nUse whatever UI framework you want! Have fun!\n","idx":5},"slack-clone":{"content":"# Slack Clone\nNot sure if we will make it to this today, if we do we will discuss considerations as a class.","idx":6},"__list__":["home","title","desc","state-of-class","final-project-requirements","warmup","slack-clone"]}